Repository: Krzysztofik/InteractiveMapWidget-main
Catalog: lib/l10n/app_*.arb
Languages: pl

# routesTitle
source: Audio routes
pl: Trasy audio

source: discovered
pl: odkryłeś

source: places
pl: miejsc

# iconSection
source: Icons on the map
pl: Ikony na mapie

# mapSection
source: Buttons on the map
pl: Przyciski na mapie

# menuSection
source: Buttons in the menu
pl: Przyciski w menu

# naviSection
source: Navigation in the top right corner
pl: Nawigacja w prawym górnym rogu

# compassSection
source: Before you start navigating, calibrate your compass.
pl: Zanim zaczniesz nawigację, skalibruj swój kompas.

# defaultTitle
source: Places to visit
pl: Miejsca do odwiedzenia

# defaultDescription
source: These are places to visit on selected routes. When you approach an object closer than 100 meters, its photo, name, a button with an audio path to listen to and the option to mark the object as visited will be displayed.
pl: Są to miejsca na wybranych trasach do odwiedzenia. Gdy podejdziesz do obiektu na bliżej niż 100 metrów, wyświetli Ci się jego zdjęcie, nazwa, przycisk zawierający ścieżke dźwiękową do odsłuchania i możliwość zaznaczenia obiektu jako odwiedzony.

# discoveredTitle
source: Already visited places
pl: Miejsca już odwiedzone

# discoveredDescription
source: The place you have visited will change its marker to this one. The route will no longer guide you through marked objects until you undo the visit. You can do this by clicking on the visited object and unchecking it.
pl: Odwiedzone przez Ciebie miejsce zmieni swój znacznik na taki. Trasa nie będzie już więcej prowadzić Cię przez zaznaczone obiekty dopóki nie cofniesz odwiedzenia obiektu. Możesz to zrobić po kliknięciu na odwiedzony obiekt i odhaczeniu go z powrotem.

# userTitle
source: Your icon on the map
pl: Twoja ikona na mapie

# userDescription
source: This is your current location on the map. However, remember that if you do not allow the app access to your location, it will not be displayed, and you will not be able to continue navigating the routes.
pl: Jest to twoja aktualna lokalizacja na mapie w której się znajdujesz. Pamiętaj jednak, że jeżeli nie zezwolisz aplikacji na dostęp do lokalizacji to nie zostanie ona wyświetlona, a Ty nie będziesz mógł kontynuować nawigacji po trasach.

# naviTitle
source: Icon during navigation
pl: Twoja ikona podczas nawigacji

# naviDescription
source: Your location icon will change to this one when you are in navigation mode. Your phone will then use the built-in compass, allowing you to see which direction you are currently facing and moving.
pl: Ikona twojej lokalizacji zmieni się na tą, gdy będziesz w trybie nawigacji. Twój telefon będzie wykorzystywał wtedy wbudowany kompas, za pomocą którego będziesz mógł widzieć w którą stronę aktualnie jesteś skierowany i w którą stronę aktualnie się poruszasz.

# audioOffTitle
source: Sound off
pl: Dźwięk wyłączony

# audioOffDescription
source: The sound in the app is turned off.
pl: Dźwięk w aplikacji jest wyłączony.

# audioOnTitle
source: Sound on
pl: Dźwięk włączony

# audioOnDescription
source: The sound in the app is turned on.
pl: Dźwięk w aplikacji jest włączony.

# menuTitle
source: Menu button
pl: Przycisk menu

# menuDescription
source: Using this button, you can choose whether you want the menu to be visible on the map or not.
pl: Za pomocą tego przycisku możesz wybrać, czy chcesz mieć menu widoczne na mapie, czy nie.

# userCenterTitle
source: Center the map
pl: Wycentruj mapę

# userCenterDescription
source: Clicking this will center the map on your location.
pl: Po kliknięciu mapa zostanie wycentrowana na twojej lokalizacji.

# startTitle
source: Start navigation
pl: Rozpocznij nawigację

# startDescription
source: Use this button to start navigation mode and explore new places on the map.
pl: Za pomocą tego przycisku rozpoczniesz tryb nawigacji i będziesz mógł odkrywać nowe miejsca na mapie.

# stopTitle
source: Stop navigation
pl: Zakończ nawigację

# stopDescription
source: Use this button to stop navigation mode.
pl: Za pomocą tego przycisku zakończysz tryb nawigacji.

# infoTitle
source: Information
pl: Informacje

# infoDescription
source: Clicking this button will take you to the route list screen with the currently selected route expanded. There, you can see what objects you will visit while navigating this route.
pl: Po kliknięciu tego przycisku zostaniesz przeniesiony do ekranu listy tras z rozwiniętą aktualnie wybraną trasą. Będziesz mógł tam zobaczyć jakie obiekty zwiedzisz w trakcie nawigowania po tej trasie.

# mapTitle
source: Map screen
pl: Ekran mapy

# mapDescription
source: Clicking this will take you to the screen where your map is located.
pl: Po kliknięciu przejdziesz do ekranu na którym znajduje się twoja mapa.

# listTitle
source: Route list screen
pl: Ekran listy tras

# listDescription
source: Clicking this will take you to the screen where your route list is displayed, with the currently selected route expanded from your menu.
pl: Po kliknięciu przejdziesz do ekranu na którym znajduje się twoja lista tras, będzie rozwinięta aktualnie wybrana trasa z twojego menu.

# startButton
source: Get started
pl: Rozpocznij

# routeInfo
source: The paths on the map are drawn from point to point, but you don't have to follow them exactly. You can navigate the route however you like.
pl: Ścieżki na mapie są rysowane od punktu do punktu, nie musisz się nimi sugerować. Możesz przejść ścieżkę w trybie nawigacji jak tylko Ci się podoba.

# markerAlert
source: Marker discovered!
pl: Marker został odkryty!

# routeAlert
source: This route is finished!
pl: Ścieżka została ukończona!

# checkBox
source: Discover this marker?
pl: Odkryć ten znacznik?

# localizationAlertTitle
source: Location permissions required
pl: Brak uprawnień do lokalizacji

# localizationAlertDescription
source: To use navigation, you need to share your location. After clicking the button below, you will have the opportunity to share it again.
pl: Aby korzystać z nawigacji, musisz udostępnić swoją lokalizację. Po kliknięciu na przycisk poniżej będziesz miał ponownie możliwość jej udostępnienia.

# localizationAlertButton
source: Proceed
pl: Przejdź dalej
